RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_spi.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_spi.c
 **
 ** A detailed description is available at
 ** @link SpiGroup Serial Peripheral Interface description @endlink
 **
 **   - 2018-10-29  CDT  First version for Device Driver Library of Spi.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_spi.h"
#include "hc32f460_utility.h"

#if (DDL_SPI_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup SpiGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*!< Parameter valid check for SPI unit */
#define IS_VALID_SPI_UNIT(x)                                                   \
(   (M4_SPI1 == (x))                            ||                             \
    (M4_SPI2 == (x))                            ||                             \
    (M4_SPI3 == (x))                            ||                             \
    (M4_SPI4 == (x)))

/*!< Parameter valid check for SS setup delay option */
#define IS_VALID_SS_SETUP_DELAY_OPTION(x)                                      \
(   (SpiSsSetupDelayTypicalSck1 == (x))         ||                             \
    (SpiSsSetupDelayCustomValue == (x)))

/*!< Parameter valid check for SS setup delay time */
#define IS_VALID_SS_SETUP_DELAY_TIME(x)                                        \
(   (SpiSsSetupDelaySck1 == (x))                ||                             \
    (SpiSsSetupDelaySck2 == (x))                ||                             \
    (SpiSsSetupDelaySck3 == (x))                ||                             \
    (SpiSsSetupDelaySck4 == (x))                ||                             \
    (SpiSsSetupDelaySck5 == (x))                ||                             \
    (SpiSsSetupDelaySck6 == (x))                ||                             \
    (SpiSsSetupDelaySck7 == (x))                ||                             \
    (SpiSsSetupDelaySck8 == (x)))

/*!< Parameter valid check for SS hold delay time */
#define IS_VALID_SS_HOLD_DELAY_TIME(x)                                         \
(   (SpiSsHoldDelaySck1 == (x))                 ||                             \
    (SpiSsHoldDelaySck2 == (x))                 ||                             \
    (SpiSsHoldDelaySck3 == (x))                 ||                             \
    (SpiSsHoldDelaySck4 == (x))                 ||                             \
    (SpiSsHoldDelaySck5 == (x))                 ||                             \
    (SpiSsHoldDelaySck6 == (x))                 ||                             \
    (SpiSsHoldDelaySck7 == (x))                 ||                             \
    (SpiSsHoldDelaySck8 == (x)))

/*!< Parameter valid check for SS hold delay option */
#define IS_VALID_SS_HOLD_DELAY_OPTION(x)                                       \
(   (SpiSsHoldDelayTypicalSck1 == (x))          ||                             \
    (SpiSsHoldDelayCustomValue == (x)))

/*!< Parameter valid check for SS interval time option */
#define IS_VALID_SS_INTERVAL_TIME_OPTION(x)                                    \
(   (SpiSsIntervalTypicalSck1PlusPck2 == (x))   ||                             \
    (SpiSsIntervalCustomValue == (x)))

/*!< Parameter valid check for SS interval time */
#define IS_VALID_SS_INTERVAL_TIME(x)                                           \
(   (SpiSsIntervalSck1PlusPck2 == (x))          ||                             \
    (SpiSsIntervalSck2PlusPck2 == (x))          ||                             \
    (SpiSsIntervalSck3PlusPck2 == (x))          ||                             \
    (SpiSsIntervalSck4PlusPck2 == (x))          ||                             \
    (SpiSsIntervalSck5PlusPck2 == (x))          ||                             \
    (SpiSsIntervalSck6PlusPck2 == (x))          ||                             \
    (SpiSsIntervalSck7PlusPck2 == (x))          ||                             \
    (SpiSsIntervalSck8PlusPck2 == (x)))

/*!< Parameter valid check for SS valid channel select */
#define IS_VALID_SS_VALID_CHANNEL(x)                                           \
(   (SpiSsValidChannel0 == (x))                 ||                             \
    (SpiSsValidChannel1 == (x))                 ||                             \
    (SpiSsValidChannel2 == (x))                 ||                             \
    (SpiSsValidChannel3 == (x)))

/*!< Parameter valid check for SS polarity */
#define IS_VALID_SS_POLARITY(x)                                                \
(   (SpiSsLowValid == (x))                      ||                             \
    (SpiSsHighValid == (x)))

/*!< Parameter valid check for read data register object */
#define IS_VALID_READ_DATA_REG_OBJECT(x)                                       \
(   (SpiReadReceiverBuffer == (x))              ||                             \
    (SpiReadSendBuffer == (x)))

/*!< Parameter valid check for SCK polarity */
#define IS_VALID_SCK_POLARITY(x)                                               \
(   (SpiSckIdleLevelLow == (x))                 ||                             \
    (SpiSckIdleLevelHigh == (x)))

