RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_spi.c
/*!< Parameter valid check for SCK phase */
#define IS_VALID_SCK_PHASE(x)                                                  \
(   (SpiSckOddSampleEvenChange == (x))          ||                             \
    (SpiSckOddChangeEvenSample == (x)))

/*!< Parameter valid check for clock division */
#define IS_VALID_CLK_DIV(x)                                                    \
(   (SpiClkDiv2 == (x))                         ||                             \
    (SpiClkDiv4 == (x))                         ||                             \
    (SpiClkDiv8 == (x))                         ||                             \
    (SpiClkDiv16 == (x))                        ||                             \
    (SpiClkDiv32 == (x))                        ||                             \
    (SpiClkDiv64 == (x))                        ||                             \
    (SpiClkDiv128 == (x))                       ||                             \
    (SpiClkDiv256 == (x)))

/*!< Parameter valid check for data length */
#define IS_VALID_DATA_LENGTH(x)                                                \
(   (SpiDataLengthBit4 == (x))                  ||                             \
    (SpiDataLengthBit5 == (x))                  ||                             \
    (SpiDataLengthBit6 == (x))                  ||                             \
    (SpiDataLengthBit7 == (x))                  ||                             \
    (SpiDataLengthBit8 == (x))                  ||                             \
    (SpiDataLengthBit9 == (x))                  ||                             \
    (SpiDataLengthBit10 == (x))                 ||                             \
    (SpiDataLengthBit11 == (x))                 ||                             \
    (SpiDataLengthBit12 == (x))                 ||                             \
    (SpiDataLengthBit13 == (x))                 ||                             \
    (SpiDataLengthBit14 == (x))                 ||                             \
    (SpiDataLengthBit15 == (x))                 ||                             \
    (SpiDataLengthBit16 == (x))                 ||                             \
    (SpiDataLengthBit20 == (x))                 ||                             \
    (SpiDataLengthBit24 == (x))                 ||                             \
    (SpiDataLengthBit32 == (x)))

/*!< Parameter valid check for first bit position */
#define IS_VALID_FIRST_BIT_POSITION(x)                                         \
(   (SpiFirstBitPositionMSB == (x))             ||                             \
    (SpiFirstBitPositionLSB == (x)))

/*!< Parameter valid check for frame number */
#define IS_VALID_FRAME_NUMBER(x)                                               \
(   (SpiFrameNumber1 == (x))                    ||                             \
    (SpiFrameNumber2 == (x))                    ||                             \
    (SpiFrameNumber3 == (x))                    ||                             \
    (SpiFrameNumber4 == (x)))

/*!< Parameter valid check for work mode */
#define IS_VALID_WORK_MODE(x)                                                  \
(   (SpiWorkMode4Line == (x))                   ||                             \
    (SpiWorkMode3Line == (x)))

/*!< Parameter valid check for transmission mode */
#define IS_VALID_COMM_MODE(x)                                                  \
(   (SpiTransFullDuplex == (x))                 ||                             \
    (SpiTransOnlySend == (x)))

/*!< Parameter valid check for master slave mode */
#define IS_VALID_MASTER_SLAVE_MODE(x)                                          \
(   (SpiModeSlave == (x))                       ||                             \
    (SpiModeMaster == (x)))

/*!< Parameter valid check for parity mode */
#define IS_VALID_PARITY_MODE(x)                                                \
(   (SpiParityEven == (x))                      ||                             \
    (SpiParityOdd == (x)))

/*!< Parameter valid check for SS channel */
#define IS_VALID_SS_CHANNEL(x)                                                 \
(   (SpiSsChannel0 == (x))                      ||                             \
    (SpiSsChannel1 == (x))                      ||                             \
    (SpiSsChannel2 == (x))                      ||                             \
    (SpiSsChannel3 == (x)))

/*!< Parameter valid check for irq type */
#define IS_VALID_IRQ_TYPE(x)                                                   \
(   (SpiIrqIdle == (x))                         ||                             \
    (SpiIrqReceive == (x))                      ||                             \
    (SpiIrqSend == (x))                         ||                             \
    (SpiIrqError == (x)))

/*!< Parameter valid check for flag type */
#define IS_VALID_FLAG_TYPE(x)                                                  \
(   (SpiFlagReceiveBufferFull == (x))           ||                             \
    (SpiFlagSendBufferEmpty == (x))             ||                             \
    (SpiFlagUnderloadError == (x))              ||                             \
    (SpiFlagParityError == (x))                 ||                             \
    (SpiFlagModeFaultError == (x))              ||                             \
    (SpiFlagSpiIdle == (x))                     ||                             \
    (SpiFlagOverloadError == (x)))

/*!< SPI registers reset value */
#define SPI_REG_DR_RESET_VALUE                  0x00000000ul
#define SPI_REG_CR1_RESET_VALUE                 0x00000000ul
#define SPI_REG_CFG1_RESET_VALUE                0x00000010ul
#define SPI_REG_SR_RESET_VALUE                  0x00000020ul
#define SPI_REG_CFG2_RESET_VALUE                0x0000031Dul

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

