RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_spi.c
/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief De-Initialize SPI unit
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_DeInit(M4_SPI_TypeDef *SPIx)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t regTemp = 0ul;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        regTemp = SPIx->SR;
        if (SPI_REG_SR_RESET_VALUE != regTemp)
        {
            SPIx->SR = SPI_REG_SR_RESET_VALUE;
        }
        SPIx->CR1 = SPI_REG_CR1_RESET_VALUE;
        SPIx->DR = SPI_REG_DR_RESET_VALUE;
        SPIx->CFG1 = SPI_REG_CFG1_RESET_VALUE;
        SPIx->CFG2 = SPI_REG_CFG2_RESET_VALUE;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Initialize SPI unit
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] pstcSpiInitCfg          Pointer to SPI init configuration
 ** \arg See the struct #stc_spi_init_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **                                     - pstcSpiInitCfg == NULL
 **
 ******************************************************************************/
en_result_t SPI_Init(M4_SPI_TypeDef *SPIx, const stc_spi_init_t *pstcSpiInitCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if((IS_VALID_SPI_UNIT(SPIx)) && (NULL != pstcSpiInitCfg))
    {
        DDL_ASSERT(IS_VALID_SS_SETUP_DELAY_OPTION(pstcSpiInitCfg->stcDelayConfig.enSsSetupDelayOption));
        DDL_ASSERT(IS_VALID_SS_SETUP_DELAY_TIME(pstcSpiInitCfg->stcDelayConfig.enSsSetupDelayTime));
        DDL_ASSERT(IS_VALID_SS_HOLD_DELAY_OPTION(pstcSpiInitCfg->stcDelayConfig.enSsHoldDelayOption));
        DDL_ASSERT(IS_VALID_SS_HOLD_DELAY_TIME(pstcSpiInitCfg->stcDelayConfig.enSsHoldDelayTime));
        DDL_ASSERT(IS_VALID_SS_INTERVAL_TIME_OPTION(pstcSpiInitCfg->stcDelayConfig.enSsIntervalTimeOption));
        DDL_ASSERT(IS_VALID_SS_INTERVAL_TIME(pstcSpiInitCfg->stcDelayConfig.enSsIntervalTime));
        DDL_ASSERT(IS_VALID_SS_VALID_CHANNEL(pstcSpiInitCfg->stcSsConfig.enSsValidBit));
        DDL_ASSERT(IS_VALID_SS_POLARITY(pstcSpiInitCfg->stcSsConfig.enSs0Polarity));
        DDL_ASSERT(IS_VALID_SS_POLARITY(pstcSpiInitCfg->stcSsConfig.enSs1Polarity));
        DDL_ASSERT(IS_VALID_SS_POLARITY(pstcSpiInitCfg->stcSsConfig.enSs2Polarity));
        DDL_ASSERT(IS_VALID_SS_POLARITY(pstcSpiInitCfg->stcSsConfig.enSs3Polarity));
        DDL_ASSERT(IS_VALID_READ_DATA_REG_OBJECT(pstcSpiInitCfg->enReadBufferObject));
        DDL_ASSERT(IS_VALID_SCK_POLARITY(pstcSpiInitCfg->enSckPolarity));
        DDL_ASSERT(IS_VALID_SCK_PHASE(pstcSpiInitCfg->enSckPhase));
        DDL_ASSERT(IS_VALID_CLK_DIV(pstcSpiInitCfg->enClkDiv));
        DDL_ASSERT(IS_VALID_DATA_LENGTH(pstcSpiInitCfg->enDataLength));
        DDL_ASSERT(IS_VALID_FIRST_BIT_POSITION(pstcSpiInitCfg->enFirstBitPosition));
        DDL_ASSERT(IS_VALID_FRAME_NUMBER(pstcSpiInitCfg->enFrameNumber));
        DDL_ASSERT(IS_VALID_WORK_MODE(pstcSpiInitCfg->enWorkMode));
        DDL_ASSERT(IS_VALID_COMM_MODE(pstcSpiInitCfg->enTransMode));
        DDL_ASSERT(IS_VALID_MASTER_SLAVE_MODE(pstcSpiInitCfg->enMasterSlaveMode));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcSpiInitCfg->enCommAutoSuspendEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcSpiInitCfg->enModeFaultErrorDetectEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcSpiInitCfg->enParitySelfDetectEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcSpiInitCfg->enParityEn));
        DDL_ASSERT(IS_VALID_PARITY_MODE(pstcSpiInitCfg->enParity));

        /* Master mode */
        if (SpiModeMaster == pstcSpiInitCfg->enMasterSlaveMode)
        {
            SPIx->CFG2_f.MSSIE = pstcSpiInitCfg->stcDelayConfig.enSsSetupDelayOption;
            SPIx->CFG2_f.MSSDLE = pstcSpiInitCfg->stcDelayConfig.enSsHoldDelayOption;
            SPIx->CFG2_f.MIDIE = pstcSpiInitCfg->stcDelayConfig.enSsIntervalTimeOption;
            SPIx->CFG1_f.MSSI = pstcSpiInitCfg->stcDelayConfig.enSsSetupDelayTime;
            SPIx->CFG1_f.MSSDL = pstcSpiInitCfg->stcDelayConfig.enSsHoldDelayTime;
            SPIx->CFG1_f.MIDI = pstcSpiInitCfg->stcDelayConfig.enSsIntervalTime;
        }
        else
        {
            SPIx->CFG2_f.MSSIE = SpiSsSetupDelayTypicalSck1;
            SPIx->CFG2_f.MSSDLE = SpiSsHoldDelayTypicalSck1;
            SPIx->CFG2_f.MIDIE = SpiSsIntervalTypicalSck1PlusPck2;
            SPIx->CFG1_f.MSSI = SpiSsSetupDelaySck1;
            SPIx->CFG1_f.MSSDL = SpiSsHoldDelaySck1;
            SPIx->CFG1_f.MIDI = SpiSsIntervalSck1PlusPck2;
        }

        /* 4 lines spi mode */
        if (SpiWorkMode4Line == pstcSpiInitCfg->enWorkMode)
        {
            SPIx->CFG2_f.SSA = pstcSpiInitCfg->stcSsConfig.enSsValidBit;
            SPIx->CFG1_f.SS0PV = pstcSpiInitCfg->stcSsConfig.enSs0Polarity;
            SPIx->CFG1_f.SS1PV = pstcSpiInitCfg->stcSsConfig.enSs1Polarity;
            SPIx->CFG1_f.SS2PV = pstcSpiInitCfg->stcSsConfig.enSs2Polarity;
            SPIx->CFG1_f.SS3PV = pstcSpiInitCfg->stcSsConfig.enSs3Polarity;
        }
        else
        {
            SPIx->CFG2_f.SSA = SpiSsValidChannel0;
            SPIx->CFG1_f.SS0PV = SpiSsLowValid;
            SPIx->CFG1_f.SS1PV = SpiSsLowValid;
            SPIx->CFG1_f.SS2PV = SpiSsLowValid;
            SPIx->CFG1_f.SS3PV = SpiSsLowValid;
        }

        /* Configure communication config register 1 */
        SPIx->CFG1_f.SPRDTD = pstcSpiInitCfg->enReadBufferObject;
        SPIx->CFG1_f.FTHLV = pstcSpiInitCfg->enFrameNumber;

        /* Configure communication config register 2 */
        SPIx->CFG2_f.LSBF = pstcSpiInitCfg->enFirstBitPosition;
        SPIx->CFG2_f.DSIZE = pstcSpiInitCfg->enDataLength;
        SPIx->CFG2_f.MBR = pstcSpiInitCfg->enClkDiv;
        SPIx->CFG2_f.CPOL = pstcSpiInitCfg->enSckPolarity;
        SPIx->CFG2_f.CPHA = pstcSpiInitCfg->enSckPhase;

