RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_spi.c
    return ((uint8_t)SPIx->DR);
}

/**
 *******************************************************************************
 ** \brief SPI receive 16bit data or 9/10/11/12/13/14/15 bit data
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \retval uint16_t                    Receive data value
 **
 ******************************************************************************/
uint16_t SPI_ReceiveData16(const M4_SPI_TypeDef *SPIx)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));

    return ((uint16_t)SPIx->DR);
}

/**
 *******************************************************************************
 ** \brief SPI receive 32bit data or 20/24 bit data
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \retval uint32_t                    Receive data value
 **
 ******************************************************************************/
uint32_t SPI_ReceiveData32(const M4_SPI_TypeDef *SPIx)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));

    return ((uint32_t)SPIx->DR);
}

/**
 *******************************************************************************
 ** \brief SPI set SS channel valid level polarity
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enChannel               Select Slave channel
 ** \arg SpiSsChannel0                  SS0 channel
 ** \arg SpiSsChannel1                  SS1 channel
 ** \arg SpiSsChannel2                  SS2 channel
 ** \arg SpiSsChannel3                  SS3 channel
 **
 ** \param [in] enPolarity              SS channel valid level polarity
 ** \arg SpiSsLowValid                  SS0~3 signal low level valid
 ** \arg SpiSsHighValid                 SS0~3 signal high level valid
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_SetSsPolarity(M4_SPI_TypeDef *SPIx, en_spi_ss_channel_t enChannel,
                              en_spi_ss_polarity_t enPolarity)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_SS_CHANNEL(enChannel));
        DDL_ASSERT(IS_VALID_SS_POLARITY(enPolarity));

        switch (enChannel)
        {
            case SpiSsChannel0:
                SPIx->CFG1_f.SS0PV = enPolarity;
                break;
            case SpiSsChannel1:
                SPIx->CFG1_f.SS1PV = enPolarity;
                break;
            case SpiSsChannel2:
                SPIx->CFG1_f.SS2PV = enPolarity;
                break;
            case SpiSsChannel3:
                SPIx->CFG1_f.SS3PV = enPolarity;
                break;
            default:
                break;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief SPI set SS valid channel
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enChannel               Select Slave channel
 ** \arg SpiSsChannel0                  SS0 channel
 ** \arg SpiSsChannel1                  SS1 channel
 ** \arg SpiSsChannel2                  SS2 channel
 ** \arg SpiSsChannel3                  SS3 channel
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_SetSsValidChannel(M4_SPI_TypeDef *SPIx, en_spi_ss_channel_t enChannel)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_SS_CHANNEL(enChannel));

        SPIx->CFG2_f.SSA = enChannel;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief SPI set read data register object
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enObject                Read data register object
 ** \arg SpiReadReceiverBuffer          Read receive buffer
 ** \arg SpiReadSendBuffer              Read send buffer(must be read when TDEF=1)
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_SetReadDataRegObject(M4_SPI_TypeDef *SPIx, en_spi_read_object_t enObject)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_READ_DATA_REG_OBJECT(enObject));

        SPIx->CFG1_f.SPRDTD = enObject;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief SPI set frame number
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enFrameNum              Once read or write frame number
 ** \arg SpiFrameNumber1                1 frame data
 ** \arg SpiFrameNumber2                2 frame data
 ** \arg SpiFrameNumber3                3 frame data
 ** \arg SpiFrameNumber4                4 frame data
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_SetFrameNumber(M4_SPI_TypeDef *SPIx, en_spi_frame_number_t enFrameNum)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_FRAME_NUMBER(enFrameNum));

