RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_spi.c
        SPIx->CFG1_f.FTHLV = enFrameNum;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief SPI set data length
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enDataLength            Read or write data length
 ** \arg SpiDataLengthBit4              4 bits
 ** \arg SpiDataLengthBit5              5 bits
 ** \arg SpiDataLengthBit6              6 bits
 ** \arg SpiDataLengthBit7              7 bits
 ** \arg SpiDataLengthBit8              8 bits
 ** \arg SpiDataLengthBit9              9 bits
 ** \arg SpiDataLengthBit10             10 bits
 ** \arg SpiDataLengthBit11             11 bits
 ** \arg SpiDataLengthBit12             12 bits
 ** \arg SpiDataLengthBit13             13 bits
 ** \arg SpiDataLengthBit14             14 bits
 ** \arg SpiDataLengthBit15             15 bits
 ** \arg SpiDataLengthBit16             16 bits
 ** \arg SpiDataLengthBit20             20 bits
 ** \arg SpiDataLengthBit24             24 bits
 ** \arg SpiDataLengthBit32             32 bits
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_SetDataLength(M4_SPI_TypeDef *SPIx, en_spi_data_length_t enDataLength)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_DATA_LENGTH(enDataLength));

        SPIx->CFG2_f.DSIZE = enDataLength;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief SPI set first bit position
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enPosition              First bit position
 ** \arg SpiFirstBitPositionMSB         Spi first bit to MSB
 ** \arg SpiFirstBitPositionLSB         Spi first bit to LSB
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_SetFirstBitPosition(M4_SPI_TypeDef *SPIx, en_spi_first_bit_position_t enPosition)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_FIRST_BIT_POSITION(enPosition));

        SPIx->CFG2_f.LSBF = enPosition;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief SPI set clock division
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enClkDiv                Clock division
 ** \arg SpiClkDiv2                     Spi pclk1 division 2
 ** \arg SpiClkDiv4                     Spi pclk1 division 4
 ** \arg SpiClkDiv8                     Spi pclk1 division 8
 ** \arg SpiClkDiv16                    Spi pclk1 division 16
 ** \arg SpiClkDiv32                    Spi pclk1 division 32
 ** \arg SpiClkDiv64                    Spi pclk1 division 64
 ** \arg SpiClkDiv128                   Spi pclk1 division 128
 ** \arg SpiClkDiv256                   Spi pclk1 division 256
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_SetClockDiv(M4_SPI_TypeDef *SPIx, en_spi_clk_div_t enClkDiv)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_CLK_DIV(enClkDiv));

        SPIx->CFG2_f.MBR = enClkDiv;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable SPI interrupt request
 **
 ** \param [in] SPIx                    Pointer to SPI unit configuration address
 ** \arg M4_SPI1                        SPI unit 1 configuration Address
 ** \arg M4_SPI2                        SPI unit 2 configuration Address
 ** \arg M4_SPI3                        SPI unit 3 configuration Address
 ** \arg M4_SPI4                        SPI unit 4 configuration Address
 **
 ** \param [in] enIrq                   SPI interrupt request type
 ** \arg SpiIrqIdle                     Spi idle interrupt request
 ** \arg SpiIrqReceive                  Spi receive interrupt request
 ** \arg SpiIrqSend                     Spi send interrupt request
 ** \arg SpiIrqError                    Spi error interrupt request
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable interrupt request
 ** \arg Enable                         Enable interrupt request
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - SPIx is invalid
 **
 ******************************************************************************/
en_result_t SPI_IrqCmd(M4_SPI_TypeDef *SPIx, en_spi_irq_type_t enIrq,
                       en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_SPI_UNIT(SPIx))
    {
        DDL_ASSERT(IS_VALID_IRQ_TYPE(enIrq));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

